{
    "1": {
        "id": "1",
        "title": "Demoscene",
        "slug": "demoscene",
        "description": "A demoscene (ejtsd: demószín) nemzetközi underground számítástechnikai szubkultúra, amelynek célja különböző számítógépes digitális művészeti alkotások („demók”) készítése.",
        "content": "A demoscene (ejtsd: demószín) nemzetközi underground számítástechnikai szubkultúra, amelynek célja különböző számítógépes digitális művészeti alkotások („demók”) készítése. Ezen alkotások jellegzetessége, hogy valós időben („realtime”) futnak a számítógépeken, azaz nem a hagyományos értelemben vett előre renderelt animációkról van szó, amiket videoformátumban terjesztenek, hanem futtatható programokról, amik a futtatás során számolják ki a megjelenő látványt és hangokat. A kultúra több mint 30 éves múltra tekint vissza, és bár a gyökerei az első mikroszámítógépekre készített illegális programmásolatok bevezetőiben keresendők, mára a műfaj már neves filmfesztiválokon önálló művészeti ággá nőtte ki magát. A demó (a demonstráció, bemutató szóból) – szakszóhasználattal élve – audiovizuális, nem-interaktív, valós idejű prezentáció. Ez nem jelent mást, mint olyan futtatható programot, amely az adott pillanatban állítja elő a képernyőn megjelenő látványt. A játékokkal szemben azonban a demó (ne keverjük össze a fogalmat egy program próba-verziója alatt értett demóprogrammal) nem előre elkészített grafikát használ, nem igényel felhasználói irányítást, a komplett látvány- és hangvilág gondosan előre megtervezett, ezeket a program a futása során állítja elő, ugyanakkor mivel a demók algoritmikusak, egyes demóknál a látvány minden lefuttatáskor másképp jelenhet meg a véletlenszámok használata miatt. A demók lehetnek méretkorlátozottak is, ezeket hívja a zsargon intróknak (az introdukció, bevezetés szóból). Manapság a legnépszerűbb intró-kategória a 64 kilobyte-os és a 4 kilobyte-os intró, de kedvelt kategória még például a 256 byte-os intró is. Forrás: Wikipédia [CC-BY-SA-3.0] (https://hu.wikipedia.org/wiki/Demoscene)",
        "imgURL": "https://upload.wikimedia.org/wikipedia/commons/e/ea/Assembly2004-areena01.jpg",
        "tag": "hun",
        "isActive": "true",
        "date": "2021. 10. 07. 13:00",
        "comments": [],
        "saves": []
    },
    "2": {
        "id": "2",
        "title": "JavaScript",
        "slug": "javascript",
        "description": "A JavaScript programozási nyelv egy objektumorientált, prototípus-alapú szkriptnyelv, amelyet weboldalakon elterjedten használnak.",
        "content": "A JavaScript programozási nyelv egy objektumorientált, prototípus-alapú szkriptnyelv, amelyet weboldalakon elterjedten használnak. Eredetileg Brendan Eich, a Netscape Communications mérnöke fejlesztette ki; neve először Mocha, majd LiveScript volt, később „JavaScript” nevet kapott, és szintaxisa közelebb került a Sun Microsystems Java programozási nyelvéhez. A JavaScriptet először 1997–99 között szabványosította az ECMA „ECMAScript” néven. A jelenleg is érvényes szabvány az ECMA-262 Edition 3 (1999. december), ami a JavaScript 1.5-nek felel meg. Ez a szabvány egyben ISO szabvány is. A Microsoft 1995-ben kifejlesztette az Internet Explorert, ami a Netscape-pel való böngészőháborúhoz vezetett. A Microsoft a Netscape Navigator JavaScript-feldolgozójának forráskódja segítségével létrehozta a sajátját, a JScriptet. A JScript először 1996-ban jelent meg a CSS kezdeti támogatása és a HTML néhány kiegészítése mellett. E megvalósítások merőben különböztek a Navigatorban alkalmazottaktól, ami megnehezítette a fejlesztőknek, hogy a weblapjaik mindkét webböngészőben jól működjenek, ami a „Netscape-en működik legjobban” és „Internet Exploreren működik legjobban” széles körű használatához vezettek sok éven át. 1996 novemberében a Netscape elküldte a JavaScriptet az ECMA International-nek, ami a sztenderddé válás kiindulópontja. Ez vezetett 1997 júniusában az első ECMAScript nyelv hivatalos kiadásához. A sztenderdizációs folyamat néhány évig folytatódott, közben az ECMAScript 2 1998 júniusában, az ECMAScript 3 1999 decemberében lett kiadva. Az ECMAScript 4-en a munka 2000 decemberében kezdődött. Közben a Microsoft egyre dominánsabb lett a böngészőpiacon. A 2000-es évek elejére az Internet Explorer részesedése elérte a 95%-ot. Ez azt jelenti, hogy a JScript tulajdonképp sztenderddé vált a weben. A Microsoft eleinte részt vett a sztenderdizációban, s néhány tervezetet is megvalósított, de végül megszűnt közreműködni.A JavaScript kód vagy a HTML fájlban, vagy külön (jellemzően .js kiterjesztésű) szövegfájlban van. Ezek a fájlok tetszőleges szövegszerkesztő (nem dokumentumszerkesztő) programmal szerkeszthetőek. A JavaScript esetében a futási környezet jellemzően egy webböngésző (JavaScript-motorja). Windowsos környezetben futtatható a wscript.exe segítségével vagy a node-dal a Node.js telepítésével. Linuxos környezetben pedig node-dal és szintén a Node.js installálása után futtatható. Bár a nyelvet szabványosították, mégis részben különbözően implementálják a JavaScriptet a különböző böngészők. Forrás: Wikipédia [CC-BY-SA-3.0] (https://hu.wikipedia.org/wiki/JavaScript)",
        "imgURL": "https://upload.wikimedia.org/wikipedia/commons/9/99/Unofficial_JavaScript_logo_2.svg",
        "tag": "hun",
        "isActive": "true",
        "date": "2021. 10. 07. 14:00",
        "comments": [],
        "saves": []
    },
    "3": {
        "id": "3",
        "title": "React (JavaScript library)",
        "slug": "react-javascript-library",
        "description": "React (also known as React.js or ReactJS) is a free and open-source front-end JavaScript library for building user interfaces or UI components.",
        "content": "React (also known as React.js or ReactJS) is a free and open-source front-end JavaScript library for building user interfaces or UI components. It is maintained by Facebook and a community of individual developers and companies. React can be used as a base in the development of single-page or mobile applications. However, React is only concerned with state management and rendering that state to the DOM, so creating React applications usually requires the use of additional libraries for routing, as well as certain client-side functionality. React was created by Jordan Walke, a software engineer at Facebook, who released an early prototype of React called 'FaxJS'. He was influenced by XHP, an HTML component library for PHP. It was first deployed on Facebook's News Feed in 2011 and later on Instagram in 2012. It was open-sourced at JSConf US in May 2013. React Native, which enables native Android, iOS, and UWP development with React, was announced at Facebook's React Conf in February 2015 and open-sourced in March 2015. On April 18, 2017, Facebook announced React Fiber, a new set of internal algorithms for rendering, as opposed to React's old rendering algorithm, Stack. React Fiber was to become the foundation of any future improvements and feature development of the React library. The actual syntax for programming with React does not change; only the way that the syntax is executed has changed. React's old rendering system, Stack, was developed at a time when the focus of the system on dynamic change was not understood. Stack was slow to draw complex animation, for example, trying to accomplish all of it in one chunk. Fiber breaks down animation into segments that can be spread out over multiple frames. Likewise, the structure of a page can be broken into segments that may be maintained and updated separately. JavaScript functions and virtual DOM objects are called 'fibers', and each can be operated and updated separately, allowing for smoother on-screen rendering. On September 26, 2017, React 16.0 was released to the public. On February 16, 2019, React 16.8 was released to the public. The release introduced React Hooks. On August 10, 2020, the React team announced the first release candidate for React v17.0, notable as the first major release without major changes to the React developer-facing API. Source: Wikipedia [CC-BY-SA-3.0] (https://en.wikipedia.org/wiki/React_(JavaScript_library)",
        "imgURL": "https://upload.wikimedia.org/wikipedia/commons/a/a7/React-icon.svg",
        "tag": "eng",
        "isActive": "true",
        "date": "2021. 10. 07. 15:00",
        "comments": [],
        "saves": []
    },
    "4": {
        "id": "4",
        "title": "Facebook",
        "slug": "facebook",
        "description": "A Facebook amerikai alapítású közösségi hálózat, amely 2004. február 4-én kezdte meg működését.",
        "content": "A Facebook amerikai alapítású közösségi hálózat, amely 2004. február 4-én kezdte meg működését. Eredetileg Thefacebook-nak hívták. Az egyik legnagyobb ismeretségi hálózat a világon, amely 2011 februárjára már több mint 637 millió regisztrált felhasználót számlált. A Facebook a világ leggyakrabban használt szociális hálózatává vált a 2009. januári Compete.com rangsorolása alapján, az aktív havi felhasználók száma szerint, megelőzve a MySpace nevű közösségi oldalt. 2009. november 25-én Mark Zuckerberg bejelentette, hogy a Skype és a Twitter mintájára tőzsdére viszi a Facebookot. 2011 tavaszán a tőzsdei bevezetést még mindig korainak találták, és az időpontját 2012-re tették, közben azonban a Facebook értékét folyamatosan számítgatták és felbecsülték. A tőzsdei bevezetésre végül 2012. május 18-án délután 17 órakor került sor. A következő mérföldkő 2012. október 4. – ezen a napon a Facebook elérte az 1 milliárd regisztrált felhasználót. Felhasználóinak száma 1,23 milliárd, a teljes internetpopuláció 38%-a. Több mint egymilliárd felhasználó használja mobiljáról a Facebookot. 2017 júniusában újabb mérföldkőhöz érkezett a portál: az aktív felhasználók száma meghaladta a 2 milliárd főt (aktív felhasználónak számít, aki az elmúlt 30 napban legalább egyszer belépett az oldalra). A közösségi háló 2021. október 4-én globálisan összeomlott és az egész világon elérhetetlenné vált, a problémát a rendszer technikusai pedig nem tudták kiküszöbölni. A Facebook után röviddel az Instagram, Whatsapp és Messenger alkalmazások is leálltak minden országban, estére pedig az Is It Down Right Now nevű hibafigyelő program is leállt az óriási terhelés következtében. A problémát október 5-ére küszöbölték ki a rendszer technikusai. A rendszer használata ingyenes, egy egyszerű regisztrálással lehet meghívás nélkül hozzá csatlakozni, szemben a 2010 végéig meghívásos alapon működő magyar iWiW-vel. A felhasználók regisztrálhatnak egy személyes Facebook-profilt, létrehozhatnak Facebook-oldalt, Facebook-csoportot, Facebook-eseményt, hirdetést, apróhirdetést tehetnek közzé, adományozhatnak és adományt gyűjthetnek ügyek számára, kapcsolódhatnak ismerőseikhez, csoportokhoz és rajongói oldalakhoz egyaránt, valamint üzeneteket válthatnak és eseményeket szervezhetnek. Az üzenőfalon keresztül híreket, információkat, weboldalakat és videókat is megoszthatnak egymással. Városok, munkahelyek, felsőoktatási intézmények vagy régiók (például Magyarország) által szervezett közösségekhez csatlakozhatnak, és érhetnek el bennük másokat. A saját hálózaton belül a mások adatlapja részleteiben is látható, míg más közösséghez tartozó felhasználó adatlapja nem, de ez függ a felhasználók egyedi beállításaitól is. 2011 augusztusában a Facebook megújította adatvédelmi és a tartalommegosztási rendszerét, jelentős részben a honlapot ért kritikák és a Google+ szerencsésebb beállításai nyomán. Néhány héttel később megjelent egy újabb frissítés, amely a közzététel rendjét szabályozza, lehetővé teszi általunk nem ismert emberek követését (beleegyezésükkel), a hírfolyamokat pedig áttekinthetőbbé teszi a barátok és az események besorolásával. Vélhetően erre a fejlesztésre is hatással volt a Google+ rendszere, amely különösen ügyel a felhasználók csoportba rendezésére és az információ ettől függő megosztására. Emellett újabb fejlesztéseket vezetnek be, amelyek online életünk számos mozzanatát naplózzák (a felkeresett tartalmakat automatikusan lájkolják); a Facebook egyfajta multimédiás központtá alakul. Az oldal létrehozásának ötlete eredetileg Mark Zuckerberg egyetemi előkészítő iskolájának, a Phillips Exeter Academynek fényképes, nyomtatott, könyv alakú kiadványa volt. Ezek a könyvek már évtizedek óta közkedveltek voltak, és használatban álltak a tanárok és a diákok számára. A Facebook története valójában 2003-ban kezdődött a Facemash nevű alkalmazás kidolgozásával. Adam D'Angelo, aki Mark Zuckerberg legjobb barátja volt a középiskolában, létrehozott az egyetemisták számára egy kezdetleges társasági oldalt. A programnak olyan sikere lett, hogy használóinak száma a százezret is meghaladta. A honlap népszerűségének hatására írta meg Mark Zuckerberg a CourseMatch programot, ami aztán a Facebook létrehozásához vezetett. Ő és Eduardo Saverin akkor alapította a Facebookot, amikor még a Harvard Egyetemre jártak, társaik voltak még a fejlesztésben Dustin Moskovitz és Chris Hughes. Kezdetben csak a Harvard hallgatói számára volt elérhető az oldal felhasználása, majd kiterjesztették az Ivy League-re és a Stanford Universityre. Azután minden egyetemista, majd minden 13 évesnél idősebb személy is regisztrálhatott a Facebookon. Peter Thiel volt az első, aki anyagilag is támogatta a céget, mintegy félmillió dollárral. Az oldalon lehet üzeneteket felírni az üzenőfalra, lehet fotókat feltölteni és megosztani. Jelenleg több mint 1 milliárd aktív felhasználója van, ez a szám napról napra emelkedik. (A Hi5 58, az Orkut pedig 46 millió körüli havi látogatószámmal bír.) Az oldal jelenleg 207 országban, 37 különböző nyelven érhető el, és 2010 januárjára már szinte teljesen elkészült a magyar változat, amelynek fordítását a felhasználók készítik. 2012-ben a Facebook megváltoztatta az Adatkezelési Szabályzatát, mert a Facebook felhasználók 30%-a nem szavazott ellene. A változás szerint a Facebook átadhatja személyes adatainkat az Instagramnak. Forrás: Wikipédia [CC-BY-SA-3.0] (https://hu.wikipedia.org/wiki/Facebook)",
        "imgURL": "https://upload.wikimedia.org/wikipedia/commons/8/86/Facebok_screenshot_in_spanish.jpg",
        "tag": "hun",
        "isActive": "true",
        "date": "2021. 10. 07. 16:00",
        "comments": [],
        "saves": []
    },
    "5": {
        "id": "5",
        "title": "Nesciunt quas odio",
        "slug": "nesciunt-quas-odio",
        "description": "Ötödik bejegyzés",
        "content": "repudiandae veniam quaerat sunt sed alias aut fugiat sit autem sed est voluptatem omnis possimus esse voluptatibus quis est aut tenetur dolor neque",
        "imgURL": "https://sienaconstruction.com/wp-content/uploads/2017/05/test-image.jpg",
        "tag": "hun",
        "isActive": "true",
        "date": "2021. 10. 07. 17:00",
        "comments": [],
        "saves": []
    },
    "6": {
        "id": "6",
        "title": "Dolorem eum magni",
        "slug": "dolorem-eum-magni",
        "description": "Sixth post",
        "content": "ut aspernatur corporis harum nihil quis provident sequi mollitia nobis aliquid molestiae perspiciatis et ea nemo ab reprehenderit accusantium quas voluptate dolores velit et doloremque molestiae",
        "imgURL": "https://sienaconstruction.com/wp-content/uploads/2017/05/test-image.jpg",
        "tag": "eng",
        "isActive": "true",
        "date": "2021. 10. 07. 18:00",
        "comments": [],
        "saves": []
    },
    "7": {
        "id": "7",
        "title": "Magnam facilis autem",
        "slug": "magnam-facilis-autem",
        "description": "Hetedik bejegyzés",
        "content": "dolore placeat quibusdam ea quo vitae magni quis enim qui quis quo nemo aut saepe quidem repellat excepturi ut quia sunt ut sequi eos ea sed quasds",
        "imgURL": "https://sienaconstruction.com/wp-content/uploads/2017/05/test-image.jpg",
        "tag": "hun",
        "isActive": "false",
        "date": "2021. 10. 07. 19:00",
        "comments": [],
        "saves": []
    }
}