{
    "html5": {
        "id": "html5",
        "title": "HTML5",
        "slug": "html5",
        "description": "A HTML5 a HTML (Hypertext Markup Language, a web fő jelölőnyelve) korábbi verzióinak az átdolgozott változata.",
        "content": "A HTML5 a HTML (Hypertext Markup Language, a web fő jelölőnyelve) korábbi verzióinak az átdolgozott változata. A kifejlesztésének egyik fő célja, hogy a webes alkalmazásokhoz ne legyen szükség pluginek (pl. Adobe Flash, Microsoft Silverlight, Oracle JavaFX) telepítésére. A specifikáció a HTML4 és az XHTML1 új verzióját jelenti, a hozzájuk tartozó DOM2 HTML API-val együtt. A HTML5 specifikációban leírt formátumba történő migráció HTML4-ről, vagy XHTML1-ről a legtöbb esetben egyszerű, mivel a visszamenőleges kompatibilitás biztosított. A specifikáció a közeljövőben támogatni fogja a Web Forms 2.0 specifikációt is. A HTML5 bevezet jó néhány új elemet (címkét) és tulajdonságot, amelyek a modern weblapokon jellemzően alkalmazott szerkezetekre kínálnak új megoldást. Néhány változtatás szemantikai jellegű, például az általánosan használt <div> és a soron belüli részek formázását biztosító <span> helyett a <nav> (a weboldal navigációs területe) és a <footer> (lábléc). Más elemek új funkciók elérését biztosítják szabványosított felületen, mint az <audio> és a <video> elemek. Néhány a HTML 4.01-ben már érvénytelenített elem az új szabványba már nem került be. Ilyenek a mai weblapokon még gyakran jelenlévő <font> és <center> elemek, amelyek hatását most már végleg CSS kóddal kell megvalósítani. Újra hangsúlyt helyeztek a DOM szkriptek (gyakorlatilag a JavaScript) jelentőségére a weboldalak viselkedésével kapcsolatban. A jelölések hasonlósága ellenére a HTML5 szintaxisa már nem az SGML-en alapul. Ezzel együtt úgy tervezték, hogy visszafelé kompatibilis legyen, így a korábbi HTML szabványokhoz készült elemzők a szokásos elemeket megérthetik. Forrás: Wikipédia [CC-BY-SA-3.0] (https://hu.wikipedia.org/wiki/HTML5)",
        "imgURL": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/61/HTML5_logo_and_wordmark.svg/1024px-HTML5_logo_and_wordmark.svg.png",
        "tag": "html",
        "language": "Hungarian",
        "isActive": "true",
        "date": "2021. 10. 07. 13:00",
        "comments": [],
        "saves": []
    },
    "javascript": {
        "id": "javascript",
        "title": "JavaScript",
        "slug": "javascript",
        "description": "A JavaScript programozási nyelv egy objektumorientált, prototípus-alapú szkriptnyelv, amelyet weboldalakon elterjedten használnak.",
        "content": "A JavaScript programozási nyelv egy objektumorientált, prototípus-alapú szkriptnyelv, amelyet weboldalakon elterjedten használnak. Eredetileg Brendan Eich, a Netscape Communications mérnöke fejlesztette ki; neve először Mocha, majd LiveScript volt, később „JavaScript” nevet kapott, és szintaxisa közelebb került a Sun Microsystems Java programozási nyelvéhez. A JavaScriptet először 1997–99 között szabványosította az ECMA „ECMAScript” néven. A jelenleg is érvényes szabvány az ECMA-262 Edition 3 (1999. december), ami a JavaScript 1.5-nek felel meg. Ez a szabvány egyben ISO szabvány is. A Microsoft 1995-ben kifejlesztette az Internet Explorert, ami a Netscape-pel való böngészőháborúhoz vezetett. A Microsoft a Netscape Navigator JavaScript-feldolgozójának forráskódja segítségével létrehozta a sajátját, a JScriptet. A JScript először 1996-ban jelent meg a CSS kezdeti támogatása és a HTML néhány kiegészítése mellett. E megvalósítások merőben különböztek a Navigatorban alkalmazottaktól, ami megnehezítette a fejlesztőknek, hogy a weblapjaik mindkét webböngészőben jól működjenek, ami a „Netscape-en működik legjobban” és „Internet Exploreren működik legjobban” széles körű használatához vezettek sok éven át. 1996 novemberében a Netscape elküldte a JavaScriptet az ECMA International-nek, ami a sztenderddé válás kiindulópontja. Ez vezetett 1997 júniusában az első ECMAScript nyelv hivatalos kiadásához. A sztenderdizációs folyamat néhány évig folytatódott, közben az ECMAScript 2 1998 júniusában, az ECMAScript 3 1999 decemberében lett kiadva. Az ECMAScript 4-en a munka 2000 decemberében kezdődött. Közben a Microsoft egyre dominánsabb lett a böngészőpiacon. A 2000-es évek elejére az Internet Explorer részesedése elérte a 95%-ot. Ez azt jelenti, hogy a JScript tulajdonképp sztenderddé vált a weben. A Microsoft eleinte részt vett a sztenderdizációban, s néhány tervezetet is megvalósított, de végül megszűnt közreműködni.A JavaScript kód vagy a HTML fájlban, vagy külön (jellemzően .js kiterjesztésű) szövegfájlban van. Ezek a fájlok tetszőleges szövegszerkesztő (nem dokumentumszerkesztő) programmal szerkeszthetőek. A JavaScript esetében a futási környezet jellemzően egy webböngésző (JavaScript-motorja). Windowsos környezetben futtatható a wscript.exe segítségével vagy a node-dal a Node.js telepítésével. Linuxos környezetben pedig node-dal és szintén a Node.js installálása után futtatható. Bár a nyelvet szabványosították, mégis részben különbözően implementálják a JavaScriptet a különböző böngészők. Forrás: Wikipédia [CC-BY-SA-3.0] (https://hu.wikipedia.org/wiki/JavaScript)",
        "imgURL": "https://upload.wikimedia.org/wikipedia/commons/9/99/Unofficial_JavaScript_logo_2.svg",
        "tag": "javascript",
        "language": "Hungarian",
        "isActive": "true",
        "date": "2021. 10. 07. 14:00",
        "comments": [],
        "saves": []
    },
    "react": {
        "id": "react",
        "title": "React (JavaScript library)",
        "slug": "react-javascript-library",
        "description": "React (also known as React.js or ReactJS) is a free and open-source front-end JavaScript library for building user interfaces or UI components.",
        "content": "React (also known as React.js or ReactJS) is a free and open-source front-end JavaScript library for building user interfaces or UI components. It is maintained by Facebook and a community of individual developers and companies. React can be used as a base in the development of single-page or mobile applications. However, React is only concerned with state management and rendering that state to the DOM, so creating React applications usually requires the use of additional libraries for routing, as well as certain client-side functionality. React was created by Jordan Walke, a software engineer at Facebook, who released an early prototype of React called 'FaxJS'. He was influenced by XHP, an HTML component library for PHP. It was first deployed on Facebook's News Feed in 2011 and later on Instagram in 2012. It was open-sourced at JSConf US in May 2013. React Native, which enables native Android, iOS, and UWP development with React, was announced at Facebook's React Conf in February 2015 and open-sourced in March 2015. On April 18, 2017, Facebook announced React Fiber, a new set of internal algorithms for rendering, as opposed to React's old rendering algorithm, Stack. React Fiber was to become the foundation of any future improvements and feature development of the React library. The actual syntax for programming with React does not change; only the way that the syntax is executed has changed. React's old rendering system, Stack, was developed at a time when the focus of the system on dynamic change was not understood. Stack was slow to draw complex animation, for example, trying to accomplish all of it in one chunk. Fiber breaks down animation into segments that can be spread out over multiple frames. Likewise, the structure of a page can be broken into segments that may be maintained and updated separately. JavaScript functions and virtual DOM objects are called 'fibers', and each can be operated and updated separately, allowing for smoother on-screen rendering. On September 26, 2017, React 16.0 was released to the public. On February 16, 2019, React 16.8 was released to the public. The release introduced React Hooks. On August 10, 2020, the React team announced the first release candidate for React v17.0, notable as the first major release without major changes to the React developer-facing API. Source: Wikipedia [CC-BY-SA-3.0] (https://en.wikipedia.org/wiki/React_(JavaScript_library)",
        "imgURL": "https://upload.wikimedia.org/wikipedia/commons/a/a7/React-icon.svg",
        "tag": "react",
        "language": "English",
        "isActive": "true",
        "date": "2021. 10. 07. 15:00",
        "comments": [],
        "saves": []
    },
    "facebook": {
        "id": "facebook",
        "title": "Facebook",
        "slug": "facebook",
        "description": "A Facebook amerikai alapítású közösségi hálózat, amely 2004. február 4-én kezdte meg működését.",
        "content": "A Facebook amerikai alapítású közösségi hálózat, amely 2004. február 4-én kezdte meg működését. Eredetileg Thefacebook-nak hívták. Az egyik legnagyobb ismeretségi hálózat a világon, amely 2011 februárjára már több mint 637 millió regisztrált felhasználót számlált. A Facebook a világ leggyakrabban használt szociális hálózatává vált a 2009. januári Compete.com rangsorolása alapján, az aktív havi felhasználók száma szerint, megelőzve a MySpace nevű közösségi oldalt. 2009. november 25-én Mark Zuckerberg bejelentette, hogy a Skype és a Twitter mintájára tőzsdére viszi a Facebookot. 2011 tavaszán a tőzsdei bevezetést még mindig korainak találták, és az időpontját 2012-re tették, közben azonban a Facebook értékét folyamatosan számítgatták és felbecsülték. A tőzsdei bevezetésre végül 2012. május 18-án délután 17 órakor került sor. A következő mérföldkő 2012. október 4. – ezen a napon a Facebook elérte az 1 milliárd regisztrált felhasználót. Felhasználóinak száma 1,23 milliárd, a teljes internetpopuláció 38%-a. Több mint egymilliárd felhasználó használja mobiljáról a Facebookot. 2017 júniusában újabb mérföldkőhöz érkezett a portál: az aktív felhasználók száma meghaladta a 2 milliárd főt (aktív felhasználónak számít, aki az elmúlt 30 napban legalább egyszer belépett az oldalra). A közösségi háló 2021. október 4-én globálisan összeomlott és az egész világon elérhetetlenné vált, a problémát a rendszer technikusai pedig nem tudták kiküszöbölni. A Facebook után röviddel az Instagram, Whatsapp és Messenger alkalmazások is leálltak minden országban, estére pedig az Is It Down Right Now nevű hibafigyelő program is leállt az óriási terhelés következtében. A problémát október 5-ére küszöbölték ki a rendszer technikusai. A rendszer használata ingyenes, egy egyszerű regisztrálással lehet meghívás nélkül hozzá csatlakozni, szemben a 2010 végéig meghívásos alapon működő magyar iWiW-vel. A felhasználók regisztrálhatnak egy személyes Facebook-profilt, létrehozhatnak Facebook-oldalt, Facebook-csoportot, Facebook-eseményt, hirdetést, apróhirdetést tehetnek közzé, adományozhatnak és adományt gyűjthetnek ügyek számára, kapcsolódhatnak ismerőseikhez, csoportokhoz és rajongói oldalakhoz egyaránt, valamint üzeneteket válthatnak és eseményeket szervezhetnek. Az üzenőfalon keresztül híreket, információkat, weboldalakat és videókat is megoszthatnak egymással. Városok, munkahelyek, felsőoktatási intézmények vagy régiók (például Magyarország) által szervezett közösségekhez csatlakozhatnak, és érhetnek el bennük másokat. A saját hálózaton belül a mások adatlapja részleteiben is látható, míg más közösséghez tartozó felhasználó adatlapja nem, de ez függ a felhasználók egyedi beállításaitól is. 2011 augusztusában a Facebook megújította adatvédelmi és a tartalommegosztási rendszerét, jelentős részben a honlapot ért kritikák és a Google+ szerencsésebb beállításai nyomán. Néhány héttel később megjelent egy újabb frissítés, amely a közzététel rendjét szabályozza, lehetővé teszi általunk nem ismert emberek követését (beleegyezésükkel), a hírfolyamokat pedig áttekinthetőbbé teszi a barátok és az események besorolásával. Vélhetően erre a fejlesztésre is hatással volt a Google+ rendszere, amely különösen ügyel a felhasználók csoportba rendezésére és az információ ettől függő megosztására. Emellett újabb fejlesztéseket vezetnek be, amelyek online életünk számos mozzanatát naplózzák (a felkeresett tartalmakat automatikusan lájkolják); a Facebook egyfajta multimédiás központtá alakul. Az oldal létrehozásának ötlete eredetileg Mark Zuckerberg egyetemi előkészítő iskolájának, a Phillips Exeter Academynek fényképes, nyomtatott, könyv alakú kiadványa volt. Ezek a könyvek már évtizedek óta közkedveltek voltak, és használatban álltak a tanárok és a diákok számára. A Facebook története valójában 2003-ban kezdődött a Facemash nevű alkalmazás kidolgozásával. Adam D'Angelo, aki Mark Zuckerberg legjobb barátja volt a középiskolában, létrehozott az egyetemisták számára egy kezdetleges társasági oldalt. A programnak olyan sikere lett, hogy használóinak száma a százezret is meghaladta. A honlap népszerűségének hatására írta meg Mark Zuckerberg a CourseMatch programot, ami aztán a Facebook létrehozásához vezetett. Ő és Eduardo Saverin akkor alapította a Facebookot, amikor még a Harvard Egyetemre jártak, társaik voltak még a fejlesztésben Dustin Moskovitz és Chris Hughes. Kezdetben csak a Harvard hallgatói számára volt elérhető az oldal felhasználása, majd kiterjesztették az Ivy League-re és a Stanford Universityre. Azután minden egyetemista, majd minden 13 évesnél idősebb személy is regisztrálhatott a Facebookon. Peter Thiel volt az első, aki anyagilag is támogatta a céget, mintegy félmillió dollárral. Az oldalon lehet üzeneteket felírni az üzenőfalra, lehet fotókat feltölteni és megosztani. Jelenleg több mint 1 milliárd aktív felhasználója van, ez a szám napról napra emelkedik. (A Hi5 58, az Orkut pedig 46 millió körüli havi látogatószámmal bír.) Az oldal jelenleg 207 országban, 37 különböző nyelven érhető el, és 2010 januárjára már szinte teljesen elkészült a magyar változat, amelynek fordítását a felhasználók készítik. 2012-ben a Facebook megváltoztatta az Adatkezelési Szabályzatát, mert a Facebook felhasználók 30%-a nem szavazott ellene. A változás szerint a Facebook átadhatja személyes adatainkat az Instagramnak. Forrás: Wikipédia [CC-BY-SA-3.0] (https://hu.wikipedia.org/wiki/Facebook)",
        "imgURL": "https://upload.wikimedia.org/wikipedia/commons/8/86/Facebok_screenshot_in_spanish.jpg",
        "tag": "facebook",
        "language": "Hungarian",
        "isActive": "true",
        "date": "2021. 10. 07. 16:00",
        "comments": [],
        "saves": []
    },
    "blog": {
        "id": "blog",
        "title": "Blog",
        "slug": "blog",
        "description": "A blog egy olyan periodikusan újabb bejegyzésekkel bővülő weboldal, amely ezek sorozatából áll, függetlenül attól, hogy mi az oldal témája, formája és hogy nyilvánosan elérhető-e.",
        "content": "A blog egy olyan periodikusan újabb bejegyzésekkel bővülő weboldal, amely ezek sorozatából áll, függetlenül attól, hogy mi az oldal témája, formája és hogy nyilvánosan elérhető-e. A bejegyzések leggyakrabban – de nem szükségszerűen – fordított időrendi sorrendben vannak. A blogok többsége nyilvános weblapként működik bármely internethasználó által elérhetően. Az eredeti „weblog” kifejezés a „web” és „log” (napló) szavak összetételéből keletkezett, ebből rövidült a mára bevetté vált blog alakká. Témája sokrétű: lehet interneten közzétett személyes, egyéni napló, de lehet egyéni vagy csoportos politikai véleménynyilvánítás vagy üzleti jellegű kommunikáció eszköze is, és lehetségesek tematikus blogok is (például kifejezetten irodalommal foglalkozó). Ennek megfelelően a szerzők köre az alkalmi szerzőktől a nagy írói közösségekig, sőt vállalatokig terjed. Sok blog teszi lehetővé a látogatóknak nyilvános megjegyzések írását az egyes bejegyzésekhez, ami közösségek kialakulásához vezethet. A blogok gyakorlatilag semmiféle formai vagy tartalmi megkötéssel nem rendelkeznek, bár többségük továbbra is hosszabb-rövidebb, döntően szöveges bejegyzésekből áll. A blogok esetében – mint általában a weblapoknál – nagyon jelentős a linkelés lehetősége, amely a bejegyzések kontextusba helyezését segíti elő. A bejegyzéseknek tipikusan permalinknek nevezett saját, állandó és egyedi linkjük van, amelyen hivatkozhatók. A blogoknál jelentős a hírcsatornák (feedek) használata, amelyek speciális webcímek, és az olvasók számára a feedolvasókon (hírolvasó programokon) keresztül lehetővé teszik a kedvenc blogjaiknak, híroldalaiknak egy helyen való olvasását, illetve az új bejegyzésekről való értesülést. A feedek legelterjedtebb formái az RSS 2.0 és az ATOM 1.0, mindkettő az XML-en alapuló szabvány. Aki blogot kíván indítani, választhat a számos szolgáltató által kínált ingyenes vagy fizetős megoldás közül, de saját maga is üzemeltethet blogmotort, amelyből több nyílt forráskódú, ingyenes megoldás is létezik. A blogolás inkább a technológiáról, különféle témákról, gondolatokról, mint a politikáról szólt, és így a blogokat és közösségeket működtető eszközök elterjedése összekötötte a bloggolást a Nyílt Forráskód mozgalommal. Olyan írók, mint Larry Lessig és David Weinberger, nem csak a blogolás népszerűsítésére használták blogjukat, hanem eltérő társadalmi modellek népszerűsítésére is. Az egyik aktuális vita témája az újságírók és a bloggerek körében, hogy a weblogolás mit jelent a hírek megjelenése és a tudósítás szempontjából. Ez a szellemi tulajdonról és a tömegmédia társadalmi szerepéről szóló kérdésekhez vezet. Sok blogger elhatárolja magát a média „fő áramlatától”, míg mások más csatornán kommunikáló média tagjainak érzik magukat. Sok bloggernek nagy tervei vannak, és a bloggolást a Nyílt Forráskód Politika részének tekintik, vagy a politikában való részvétel növelésének lehetőségeként, így segítve a vita kereteinek meghatározását. Azonban az intézmények a blogolást a „szűrő megkerülésének” tekintik, és közvetlen üzeneteket juttatnak el a nyilvánossághoz (ld. marketing). Forrás: Wikipédia [CC-BY-SA-3.0] (https://hu.wikipedia.org/wiki/Blog)",
        "imgURL": "https://upload.wikimedia.org/wikipedia/commons/d/db/Wordpress205.png",
        "tag": "blog",
        "language": "Hungarian",
        "isActive": "true",
        "date": "2021. 10. 07. 17:00",
        "comments": [],
        "saves": []
    },
    "jsx": {
        "id": "jsx",
        "title": "JSX",
        "slug": "jsx",
        "description": "JSX (JavaScript Syntax Extension and occasionally referred as JavaScript XML) is an extension to the JavaScript language syntax which provides a way to structure component rendering using syntax familiar to many developers. It is similar in appearance to HTML.",
        "content": "JSX (JavaScript Syntax Extension and occasionally referred as JavaScript XML) is an extension to the JavaScript language syntax which provides a way to structure component rendering using syntax familiar to many developers. It is similar in appearance to HTML. React components are typically written using JSX, although they do not have to be as components may also be written in pure JavaScript. JSX is similar to another extension syntax created by Facebook for PHP called XHP. Multiple elements on the same level need to be wrapped in a single React element such as the <div> element shown above, a fragment delineated by <Fragment> or in its shorthand form <>, or returned as an array. JSX provides a range of element attributes designed to mirror those provided by HTML. Custom attributes can also be passed to the component. All attributes will be received by the component as props. JavaScript expressions (but not statements) can be used inside JSX with curly brackets {}. If–else statements cannot be used inside JSX but conditional expressions can be used instead. The example below will render { i === 1 ? 'true' : 'false' } as the string 'true' because i is equal to 1. Code written in JSX requires conversion with a tool such as Babel before it can be understood by web browsers. This processing is generally performed during a software build process before the application is deployed. Source: Wikipedia [CC-BY-SA-3.0] (https://en.wikipedia.org/wiki/JSX_(JavaScript))",
        "imgURL": "https://upload.wikimedia.org/wikipedia/commons/a/a7/React-icon.svg",
        "tag": "jsx",
        "language": "English",
        "isActive": "true",
        "date": "2021. 10. 07. 18:00",
        "comments": [],
        "saves": []
    },
    "html": {
        "id": "html",
        "title": "HTML",
        "slug": "html",
        "description": "A HTML (angolul: HyperText Markup Language=hiperszöveges jelölőnyelv) egy leíró nyelv, melyet weboldalak készítéséhez fejlesztettek ki, és mára már internetes szabvánnyá vált a W3C (World Wide Web Consortium) támogatásával.",
        "content": "A HTML (angolul: HyperText Markup Language=hiperszöveges jelölőnyelv) egy leíró nyelv, melyet weboldalak készítéséhez fejlesztettek ki, és mára már internetes szabvánnyá vált a W3C (World Wide Web Consortium) támogatásával. Az aktuális változata az 5, mely az SGML általános jelölőnyelv egy konkrét alkalmazása (azaz minden 5-ös HTML dokumentum egyben az SGML dokumentumszabványnak is meg kell hogy feleljen). Ezt tervek szerint lassan kiszorította volna az XHTML, amely a szintén SGML alapú XML leíró nyelven alapul. HTML általában szöveges állományokban található meg olyan számítógépeken, melyek az internethez kapcsolódnak. Ezek az állományok tartalmazzák azokat a szimbólumokat, amelyek a megjelenítő programnak leírják, hogyan is kell megjeleníteni illetve feldolgozni az adott állomány tartalmát. Megjelenítő program lehet egy webböngésző (angolul: web browser), aural böngésző (olyan, amelyik a felhasználónak felolvassa a megjelenítendő szöveget), braille olvasó, amely konvertálja a szöveget braille 'formátumba', levelező program (mint például: Mozilla Thunderbird, Microsoft Outlook, Eudora stb.), valamint egyéb eszközök, például mobiltelefon. Négyfajta szimbólum (leíró elem) található meg a HTML-ben: strukturális elemek, amelyek leírják az adott szöveg 'célját' például <h1>Téma 1</h1> mint első szintű címsor (alcím), prezentációs szimbólumok, amelyek leírják, hogy az adott szöveg hogyan nézzen ki: például <b>vastag</b> vastag kinézetet eredményez. (Ez a forma azonban ma már elavultnak számít, helyette a CSS használata javasolt, ugyanis a legújabb irányelv szerint szét kell választani a tartalmat (amit a HTML kódol) és a formát (amit CSS-ben szokás kódolni), és ezáltal mindenki számára elérhetővé tehetőek a weblapok: felolvasó gépeknek, amit a gyengén látók használnak, szöveges böngészőknek, és nyomtatóbarát verziót is könnyebb készíteni.), hiperszöveg (hypertext) elemek, amelyek segítségével kapcsolat létesíthető a dokumentum egyes elemei és más dokumentumok között (például a <a href='https://hu.wikipedia.org/'>Wikipedia</a> a Wikipedia szót mint egy kapcsolatot (angol szóval: link) a megadott URL-hez jeleníti meg, eszköz elemek, amelyek segítségével gombok, listák, beviteli mezők hozhatók létre. Forrás: Wikipédia [CC-BY-SA-3.0] (https://hu.wikipedia.org/wiki/HTML)",
        "imgURL": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a6/HTML_source_code_example.svg/1280px-HTML_source_code_example.svg.png",
        "tag": "html",
        "language": "Hungarian",
        "isActive": "false",
        "date": "2021. 10. 07. 19:00",
        "comments": [],
        "saves": []
    }
}